SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_tim.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_tim.h
*\*\author Nations
*\*\version v1.0.2
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/
#ifndef __N32G430_TIM_H__
#define __N32G430_TIM_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g430.h"
#include "stdbool.h"


/**
*\*\brief  TIM Time Base Init structure definition
*\*\note   This structure is used with all TIMx except for TIM6 and TIM7.
**/

typedef struct
{
    uint16_t Prescaler; /* Specifies the prescaler value used to divide the TIM clock.
                                 This parameter can be a number between 0x0000 and 0xFFFF */

    uint16_t CntMode; /* Specifies the counter mode.
                                   This parameter can be a value of TIM_Counter_Mode */

    uint16_t Period; /* Specifies the period value to be loaded into the active
                              Auto-Reload Register at the next update event.
                              This parameter must be a number between 0x0000 and 0xFFFF.  */

    uint16_t ClkDiv; /* Specifies the clock division.
                                    This parameter can be a value of TIM_Clock_Division_CKD */

    uint8_t RepetCnt; /* Specifies the repetition counter value. Each time the REPCNT downcounter
                                        reaches zero, an update event is generated and counting restarts
                                        from the REPCNT value (N).
                                        This means in PWM mode that (N+1) corresponds to:
                                           - the number of PWM periods in edge-aligned mode
                                           - the number of half PWM period in center-aligned mode
                                        This parameter must be a number between 0x00 and 0xFF.
                                        @note This parameter is valid only for TIM1 and TIM8. */

    bool CapCh1Sel;    /* channel 1 select capture in from comp if 1, from IOM if 0
                                Tim1,Tim8,Tim2,Tim3,Tim4,Tim5 valid*/
    bool CapCh2Sel;    /* channel 2 select capture in from LSE if 1, from IOM if 0
                                Tim2 valid*/
    bool CapCh3Sel;    /* channel 3 select capture in from LSI if 1, from IOM if 0
                                Tim2 valid*/
    bool CapCh4Sel;    /* channel 4 select capture in from HSE/128 if 1, from IOM if 0
                                Tim2 valid*/
    bool CapEtrClrFromCompEn; /* etr clearref select from comp if 1, from ETR IOM if 0
                                Tim1, TIM8, Tim2,Tim3,Tim4 valid*/
    bool CapEtrSelFromTscEn;  
} TIM_TimeBaseInitType;

/**
*\*\brief  TIM Output Compare Init structure definition
**/

typedef struct
{
    uint16_t OcMode; /* Specifies the TIM mode.
                              This parameter can be a value of TIM_Output_Compare_and_PWM_modes */

    uint16_t OutputState; /* Specifies the TIM Output Compare state.
                                   This parameter can be a value of TIM_Output_Compare_state */

    uint16_t OutputNState; /* Specifies the TIM complementary Output Compare state.
                                    This parameter can be a value of TIM_Output_Compare_N_state
                                    - note This parameter is valid only for TIM1 and TIM8. */

    uint16_t Pulse; /* Specifies the pulse value to be loaded into the Capture Compare Register.
                             This parameter can be a number between 0x0000 and 0xFFFF */

    uint16_t OcPolarity; /* Specifies the output polarity.
                                  This parameter can be a value of TIM_Output_Compare_Polarity */

    uint16_t OcNPolarity; /* Specifies the complementary output polarity.
                                   This parameter can be a value of TIM_Output_Compare_N_Polarity
                                   - note This parameter is valid only for TIM1 and TIM8. */

    uint16_t OcIdleState; /* Specifies the TIM Output Compare pin state during Idle state.
                                   This parameter can be a value of TIM_Output_Compare_Idle_State
                                   - note This parameter is valid only for TIM1 and TIM8. */

    uint16_t OcNIdleState; /* Specifies the TIM Output Compare pin state during Idle state.
                                    This parameter can be a value of TIM_Output_Compare_N_Idle_State
                                    - note This parameter is valid only for TIM1 and TIM8. */
} OCInitType;

/**
*\*\brief  TIM Input Capture Init structure definition
**/

typedef struct
{
    uint16_t Channel; /*! Specifies the TIM channel.This parameter can be a value of Channel */

    uint16_t IcPolarity; /* Specifies the active edge of the input signal. */

    uint16_t IcSelection; /* Specifies the input. */

    uint16_t IcPrescaler; /* Specifies the Input Capture Prescaler. */

    uint16_t IcFilter; /* Specifies the input capture filter. */
} TIM_ICInitType;

/**
*\*\brief  BKDT structure definition
*\*\note   This structure is used only with TIM1 and TIM8.
**/

typedef struct
{
    uint16_t OssrState; /* Specifies the Off-State selection used in Run mode.
                                 This parameter can be a value of OSSR_Off_State_Selection_for_Run_mode_state */

    uint16_t OssiState; /* Specifies the Off-State used in Idle state.
                                 This parameter can be a value of OSSI_Off_State_Selection_for_Idle_mode_state */

    uint16_t LockLevel; /* Specifies the LOCK level parameters.
                                 This parameter can be a value of Lock_level */

    uint16_t DeadTime; /* Specifies the delay time between the switching-off and the
                                switching-on of the outputs.
                                This parameter can be a number between 0x00 and 0xFF  */

